/* Xina平水韻拼音方案
 * https://zhuanlan.zhihu.com/p/1965117624921887448
 * @author Xina
 */

/** @type { 音韻地位['屬於'] } */
const is = (...x) => 音韻地位.屬於(...x);
/** @type { 音韻地位['判斷'] } */
const when = (...x) => 音韻地位.判斷(...x);

if (!音韻地位) return [
  // 在此輸入方案選項……
];

const 聲母規則 = () =>when([
  ['幫母', [['三等 C類', 'f'], ['', 'p']]],
  ['滂母', [['三等 C類', 'fh'], ['', 'ph']]],
  ['並母', [['三等 C類', 'v'], ['', 'b']]],
  ['明母', [['三等 C類', 'mg'], ['', 'm']]],
  ['端母', 't'], ['透母', 'th'], ['定母', 'd'], ['泥母', 'n'],
  ['知母', 'tr'], ['徹母', 'thr'], ['澄母', 'dr'], ['孃母', 'nr'],
  ['精母', 'c'], ['清母', 'ch'], ['從母', 'x'], ['心母', 's'], ['邪母', 'z'],
  ['莊母', 'cr'], ['初母', 'chr'], ['崇母', 'xr'], ['生母', 'sr'], ['俟母', 'zr'],
  ['章母', 'cj'], ['昌母', 'chj'], ['常母', 'xj'], ['書母', 'sj'], ['船母', 'zj'],
  ['見母', 'k'], ['溪母', 'kh'], ['羣母', 'g'], ['疑母', 'ng'],
  ['曉母', 'h'], ['匣母', 'gh'], ['影母', 'q'], ['云以母', ''],
  ['來母', 'l'], ['日母', 'nj']
], '無聲母規則');

const 介音規則 = () =>when([
  ['一二四等', [
    ['灰魂韻', 'w'],
    ['', [['合口', 'w'], ['', '']]]
  ]],
  ['三等', [
    ['A類', [['合口', 'wi'], ['', 'i']]],
    ['B類', [['合口', 'wy'], ['', 'y']]],
    ['C類', [
      ['幫組', ''],
      ['', [['合口', 'wy'], ['', 'y']]]
    ]],
    ['', [
      ['精組 或 章組 或 日母 或 以母', [['合口', 'wi'], ['', 'i']]],
      ['', [['合口', 'wy'], ['', 'y']]]
    ]]
  ]]
], '無介音規則');

const 韻腹規則 = () =>when([
  ['歌泰豪覃談寒陽唐韻', 'a'],
  ['麻佳皆夬肴咸銜刪山庚耕清江韻', 'ae'],
  ['齊祭蕭宵鹽添先仙青韻', 'e'],
  ['支脂之侵真臻韻', 'i'],
  ['灰咍廢尤侯幽嚴凡元魂痕蒸登東韻', 'o'],
  ['虞模文冬鍾韻', 'u'],
  ['微韻', [['開口', 'y'], ['', 'u']]],
  ['魚殷韻', 'y']
], '無韻腹規則');

const 韻尾規則 = () =>when([
  ['歌麻支虞模魚韻', ''],
  ['泰佳皆夬齊祭脂之灰咍廢微韻', 'j'],
  ['豪肴蕭宵尤侯幽韻', 'w'],
  ['覃談咸銜鹽添侵嚴凡韻', [['入聲', 'p'], ['', 'm']]],
  ['寒刪山先仙真臻元魂痕文殷韻', [['入聲', 't'], ['', 'n']]],
  ['陽唐庚耕清青蒸登冬鍾韻', [['入聲', 'k'], ['', 'ng']]],
  ['江東韻', [['入聲', 'wk'], ['', 'wng']]]
], '無韻尾規則');

const 聲調規則 = () =>when([
  ['上聲', 'q'],
  ['去聲', 'h'],
  ['', '']
], '無聲調規則');

let 聲母 = 聲母規則();
let 介音 = 介音規則();
let 韻腹 = 韻腹規則();
let 韻尾 = 韻尾規則();
let 聲調 = 聲調規則();

// 去除重複字母
if (介音 + 韻腹 === 'ii' ||
    介音 + 韻腹 === 'wu' ||
    介音 + 韻腹 === 'wii' ||
    介音 + 韻腹 === 'yy'
)
韻腹 = '';
if (介音 + 韻腹 === 'wiu') 介音 = 'i';
if (介音 + 韻腹 === 'wyu') 介音 = 'y';

return 聲母 + 介音 + 韻腹 + 韻尾 + 聲調;
